# Day 20

In [1]:
import mysql.connector
mydb=mysql.connector.connect(host="localhost",user="root",password="12345")
cur=mydb.cursor()
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000029E058D5E20>

In [2]:
cur=mydb.cursor()
cur.execute("CREATE DATABASE Employee_Details")

In [7]:
dbse=mydb.cursor()
dbse.execute("SHOW DATABASES")
for entry in dbse:
    print(entry)

('doctors',)
('employee_details',)
('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('students_management_system',)
('sys',)

# Create an Employee Table with Employee Name, Employee ID & Salary

In [9]:
mydb=mysql.connector.connect(host="localhost",user="root",password="12345",database="Employee_Details")
dbse=mydb.cursor()
dbse.execute("CREATE TABLE EMPLOYEES(EMPLOYEE_ID INT,EMPLOYEE_NAME VARCHAR(255),EMPLOYEE_SALARY DOUBLE)")

In [11]:
mydb=mysql.connector.connect(host="localhost",user="root",password="12345",database="Employee_Details")
dbse=mydb.cursor()
dbse.execute("SHOW TABLES")
for entry in dbse:
    print(entry)

('employees',)

In [12]:
dbse=mydb.cursor()
dbse.execute("SHOW COLUMNS FROM EMPLOYEES")
for entry in dbse:
    print(entry)

('EMPLOYEE_ID', b'int', 'YES', '', None, '')
('EMPLOYEE_NAME', b'varchar(255)', 'YES', '', None, '')
('EMPLOYEE_SALARY', b'double', 'YES', '', None, '')

In [15]:
mydb=mysql.connector.connect(host="localhost",user="root",password="12345",database="Employee_Details")
dbse=mydb.cursor()
sql="INSERT INTO EMPLOYEES(EMPLOYEE_ID,EMPLOYEE_NAME,EMPLOYEE_SALARY) VALUES(%s,%s,%s)"
val=[(1,'Mesh',2000000),(2,'Raji',125000),(3,'Thana',80000),(4,'Sudha',65000),(5,'Priya',90000),(6,'Padma',190000),(7,'Karthi',25000),(8,'Ganesh',40000),(9,'Femee',75000),(10,'Rosy',100000),(11,'Mothi',11000),(12,'Siva',5000)]
dbse.executemany(sql,val)
mydb.commit()
print(dbse.rowcount,"Records Inserted")

12 Records Inserted

In [16]:
mycursor=mydb.cursor()
mycursor.execute("SELECT * FROM EMPLOYEES")
myresult=mycursor.fetchall()
for x in myresult:
    print(x)

(1, 'Mesh', 2000000.0)
(2, 'Raji', 125000.0)
(3, 'Thana', 80000.0)
(4, 'Sudha', 65000.0)
(5, 'Priya', 90000.0)
(6, 'Padma', 190000.0)
(7, 'Karthi', 25000.0)
(8, 'Ganesh', 40000.0)
(9, 'Femee', 75000.0)
(10, 'Rosy', 100000.0)
(11, 'Mothi', 11000.0)
(12, 'Siva', 5000.0)

# Write a query to get the maximum and minimum salary from employees table

In [21]:
mycursor=mydb.cursor()
mycursor.execute("SELECT * from EMPLOYEES where EMPLOYEE_SALARY=(SELECT max(EMPLOYEE_SALARY) from EMPLOYEES)")
myresult=mycursor.fetchall()
for x in myresult:
    print(x)

(1, 'Mesh', 2000000.0)

In [22]:
mycursor=mydb.cursor()
mycursor.execute("SELECT * from EMPLOYEES where EMPLOYEE_SALARY=(SELECT min(EMPLOYEE_SALARY) from EMPLOYEES)")
myresult=mycursor.fetchall()
for x in myresult:
    print(x)

(12, 'Siva', 5000.0)

# Write a query to get the number of employees working with the company

In [23]:
mycursor=mydb.cursor()
mycursor.execute("SELECT COUNT(*) from EMPLOYEES")
myresult=mycursor.fetchall()
for x in myresult:
    print(x)

(12,)

# Write a query to get the first 3 characters of first name from employees table

In [24]:
mycursor=mydb.cursor()
mycursor.execute("SELECT SUBSTRING(EMPLOYEE_NAME,1,3) from EMPLOYEES")
myresult=mycursor.fetchall()
for x in myresult:
    print(x)

('Mes',)
('Raj',)
('Tha',)
('Sud',)
('Pri',)
('Pad',)
('Kar',)
('Gan',)
('Fem',)
('Ros',)
('Mot',)
('Siv',)